# Итоговая проверочная работа
## Условия задачи
#### Задача алгоритмически не самая сложная, однако для полноценного выполнения проверочной работы необходимо:

1 Создать репозиторий на `GitHub`

2 Нарисовать блок-схему алгоритма (можно обойтись блок-схемой основной содержательной части, если вы выделяете её в отдельный метод)

3 Снабдить репозиторий оформленным текстовым описанием решения (файл README.md)

4 Написать программу, решающую поставленную задачу

5 Использовать контроль версий в работе над этим небольшим проектом (не должно быть так, что всё залито одним коммитом, как минимум этапы 2, 3, и 4 должны быть расположены в разных коммитах)

### Задача:

Написать программу, которая из имеющегося массива строк формирует новый массив из строк, длина которых меньше, либо равна 3 символам. Первоначальный массив можно ввести с клавиатуры, либо задать на старте выполнения алгоритма. При решении не рекомендуется пользоваться коллекциями, лучше обойтись исключительно массивами.

Репозиторий снабжен файлом ```README.md```

### ***Содержание кода программы на языке `C#`:***
```c#
string[] str_array = ["Hello", "2", "world", ":-)"];
int count = 0;

foreach(string str in str_array)
{
    if(str.Length <= 3)
    {
        count++;
    }
}

string[] res_array= new string[count];
int j = 0;
for(int i = 0; i < str_array.Length; i++)
{
   
    if(str_array[i].Length <= 3)
    {
        res_array[j] = str_array[i];
        j++;
    }
}

void printArr(string[] array)
{
    for (int i = 0; i < array.Length; i++)
    {
        Console.Write($"{array[i]} ");
    }
    Console.WriteLine();
}
printArr(res_array);

```
